In [2]:
import pandas as pd
df = pd.read_csv('exam1.csv')

In [3]:
df

   rollno              name  UT1  UT2  UT3  UT4
0       1      Prerna Singh   24   24   20   22
1       2      Manish Arora   18   17   19   22
2       3       Tanish Goel   20   22   18   24
3       4      Falguni Jain   22   20   24   20
4       5  Kanika Bhatnagar   15   20   18   22
5       6    Ramandeep Kaur   20   15   22   24

In [4]:
df.rollno

0    1
1    2
2    3
3    4
4    5
5    6
Name: rollno, dtype: int64

In [163]:
df.set_index('rollno')

                    name  UT1  UT2  UT3  UT4
rollno
1           Prerna Singh   24   24   20   22
2           Manish Arora   18   17   19   22
3            Tanish Goel   20   22   18   24
4           Falguni Jain   22   20   24   20
5       Kanika Bhatnagar   15   20   18   22
6         Ramandeep Kaur   20   15   22   24

In [9]:
df.columns

Index(['rollno', 'name', 'UT1', 'UT2', 'UT3', 'UT4'], dtype='object')

In [14]:
print(df.columns)

Index(['rollno', 'name', 'UT1', 'UT2', 'UT3', 'UT4'], dtype='object')

In [159]:
df.loc[df.UT4==24]

   rollno            name  UT1  UT2  UT3  UT4
2       3     Tanish Goel   20   22   18   24
5       6  Ramandeep Kaur   20   15   22   24

In [173]:
df.max()

rollno              6
name      Tanish Goel
UT1                24
UT2                24
UT3                24
UT4                24
dtype: object

In [15]:
x = 5
y = 7
z = x+y+1

In [16]:
z

13

In [18]:
x = "test"
type(x)

str

In [20]:
y = False
type(y)

bool

In [51]:
letter = input("Enter a character: ") #question 1 
if letter in ("a","e","i","o","u"):
    print(letter, "is a Vowel")
else:
    print(letter, "is a Consonant")

Enter a character: a
a is a Vowel

In [68]:
def sentence(word): #question 2
    if word == word[::-1]:
        print(word , "is palindrome")
    else:
        print("The given word is not palindrome")

In [70]:
sentence("radar")

radar is palindrome

In [73]:
user = input("Enter the string you want reversed: ")[::-1] #question 3
print("The reversed string: ", user)

Enter the string you want reversed: apple
The reversed string:  elppa

In [79]:
new_list = input("Enter a list: ") #question 4 
print(new_list[::-1])

Enter a list: 1,2,3,4,5
5,4,3,2,1

In [105]:
sum(2,3,4,5)

TypeError: can only concatenate tuple (not "int") to tuple

In [1]:
number = int(input("Enter a number: "))    #5
factorial = 1    
if number < 0:    
    print("Enter a number greater than zero")    
else:    
    for i in range(1,number + 1):    
        factorial = factorial*i    
    print("The factorial of",number,"is",factorial)

Enter a number:  3

The factorial of 3 is 6